{
  "activation_fn": "gelu",
  "architectures": [
    "ITERForRelationExtraction"
  ],
  "d_ff": 4096,
  "d_model": 1024,
  "dataset": "conll04",
  "dropout": 0.3,
  "entity_types": [
    "Loc",
    "Org",
    "Peop",
    "Other"
  ],
  "features": 0,
  "link_types": [
    "Work_For",
    "Kill",
    "OrgBased_In",
    "Live_In",
    "Located_In"
  ],
  "max_length": 512,
  "max_nest_depth": 1,
  "model_type": "iter",
  "num_links": 5,
  "num_types": 4,
  "threshold": 0.5,
  "torch_dtype": "float32",
  "transformer_config": {
    "_name_or_path": "bert-large-cased",
    "architectures": [
      "BertForMaskedLM"
    ],
    "attention_probs_dropout_prob": 0.1,
    "classifier_dropout": null,
    "decoder_start_token_id": null,
    "directionality": "bidi",
    "eos_token_id": null,
    "gradient_checkpointing": false,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 1024,
    "initializer_range": 0.02,
    "intermediate_size": 4096,
    "is_encoder_decoder": false,
    "layer_norm_eps": 1e-12,
    "max_length": 512,
    "max_position_embeddings": 512,
    "model_type": "bert",
    "num_attention_heads": 16,
    "num_hidden_layers": 24,
    "pooler_fc_size": 768,
    "pooler_num_attention_heads": 12,
    "pooler_num_fc_layers": 3,
    "pooler_size_per_head": 128,
    "pooler_type": "first_token_transform",
    "position_embedding_type": "absolute",
    "task_specific_params": null,
    "type_vocab_size": 2,
    "vocab_size": 28996
  },
  "transformers_version": "4.47.1",
  "use_bias": false,
  "use_gate": true,
  "use_mlp": true,
  "use_scale": true
}
